title: AWS route53domains RegisterDomain Attempt
id: 52bed480-6f6a-5499-8484-7ac41a5f90a0
status: experimental
description: |
    This operation registers a domain. For some top-level domains (TLDs), this operation requires extra parameters.
    Security implications: Attackers might use RegisterDomain to register malicious domains for phishing or malware distribution.
    Observed in real-world incidents/reporting, e.g.: The curious case of DangerDev@protonmail.me.
references:
    - https://www.invictus-ir.com/news/the-curious-case-of-dangerdev-protonmail-me
    - https://aws.permissions.cloud/iam/route53domains#route53domains-RegisterDomain
    - https://traildiscover.cloud/#route53domains-RegisterDomain
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.resource-development
    - attack.t1583 #Acquire Infrastructure
    - attack.t1583.001 #Acquire Infrastructure: Domains
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: route53domains.amazonaws.com
        eventName: RegisterDomain
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and (error_code or error_msg)
falsepositives:
    - Legitimate provisioning or configuration changes by administrators or CI/CD pipelines.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK, Pulumi) applying changes.
level: low
