title: AWS IAM ListSigningCertificates
id: 639a615e-bfeb-5816-8c93-15f8219f8909
status: experimental
description: |
    Returns information about the signing certificates associated with the specified IAM user.
    Security implications: Attackers might use ListSigningCertificates to review which users have active certificates
    Observed in real-world incidents/reporting, e.g.: Muddled Libra’s Evolution to the Cloud.
references:
    - https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud/
    - https://aws.permissions.cloud/iam/iam#iam-ListSigningCertificates
    - https://traildiscover.cloud/#IAM-ListSigningCertificates
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1087 #Account Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName: ListSigningCertificates
    condition: selection
falsepositives:
    - Routine enumeration by administrators, monitoring/inventory tools, or the AWS Console and SDKs.
    - Security, backup, or cost-management tooling that periodically reads this resource.
level: informational
