title: AWS EC2 CreateKeyPair
id: 4796246e-9684-586c-b412-3e902baa17b3
status: experimental
description: |
    Creates an ED25519 or 2048-bit RSA key pair with the specified name and in the specified PEM or PPK format.
    Security implications: Attackers might use CreateKeyPair to generate keys that can latter be used to access EC2s.
    Ex: aws ec2 create-key-pair --key-name TrailDiscoverKeyPair
    Observed in real-world incidents/reporting, e.g.: The curious case of DangerDev@protonmail.me; ANATOMY OF AN ATTACK: EXPOSED KEYS TO CRYPTO MINING; UNMASKING GUI-VIL: FINANCIALLY MOTIVATED CLOUD THREAT ACTOR; Leaked Environment Variables Allow Large-Scale Extortion Operation in Cloud Environments.
references:
    - https://www.invictus-ir.com/news/the-curious-case-of-dangerdev-protonmail-me
    - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor/
    - https://unit42.paloaltonetworks.com/large-scale-cloud-extortion-operation/
    - https://securitylabs.datadoghq.com/articles/following-attackers-trail-in-aws-methodology-findings-in-the-wild/
    - https://aws.permissions.cloud/iam/ec2#ec2-CreateKeyPair
    - https://traildiscover.cloud/#EC2-CreateKeyPair
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.persistence
    - attack.t1098 #Account Manipulation
    - attack.t1098.001 #Account Manipulation: Additional Cloud Credentials
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: CreateKeyPair
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Legitimate provisioning or configuration changes by administrators or CI/CD pipelines.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK, Pulumi) applying changes.
level: medium
