title: AWS CostExplorer GetCostAndUsage
id: 2bd25077-59ba-5688-95cb-ca54a8a1c6c8
status: experimental
description: |
    Retrieves cost and usage metrics for your account.
    Security implications: Attackers might use GetCostAndUsage to determine how active an account is by understanding the cost within a cloud account.
    Observed in real-world incidents/reporting, e.g.: When a Zero Day and Access Keys Collide in the Cloud: Responding to the SugarCRM Zero-Day Vulnerability; Crimson Collective: A New Threat Group Observed Operating in the Cloud.
references:
    - https://unit42.paloaltonetworks.com/sugarcrm-cloud-incident-black-hat/
    - https://www.rapid7.com/blog/post/tr-crimson-collective-a-new-threat-group-observed-operating-in-the-cloud/
    - https://aws.permissions.cloud/iam/ce#ce-GetCostAndUsage
    - https://traildiscover.cloud/#CostExplorer-GetCostAndUsage
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1526 #Cloud Service Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ce.amazonaws.com
        eventName: GetCostAndUsage
    condition: selection
falsepositives:
    - Routine enumeration by administrators, monitoring/inventory tools, or the AWS Console and SDKs.
    - Security, backup, or cost-management tooling that periodically reads this resource.
level: informational
