title: AWS S3 GetBucketOwnershipControls
id: 4c9aa3c1-c944-5dd7-9e43-9caa87353cf7
status: experimental
description: |
    Retrieves OwnershipControls for an Amazon S3 bucket.

    Security implications: Attackers might use GetBucketOwnershipControls to check the ownership configuration.

    Observed in real-world incidents/reporting, e.g.: Leaked Environment Variables Allow Large-Scale Extortion Operation in Cloud Environments.
references:
    - https://unit42.paloaltonetworks.com/large-scale-cloud-extortion-operation/
    - https://aws.permissions.cloud/iam/s3#s3-GetBucketOwnershipControls
    - https://traildiscover.cloud/#S3-GetBucketOwnershipControls
author: Adan Alvarez (@adanalvarez), Yamato Security
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1526 #Cloud Service Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: s3.amazonaws.com
        eventName: GetBucketOwnershipControls
    condition: selection
falsepositives:
level: low
