title: AWS Health DescribeEvents
id: 87bdec77-4f25-55bc-9daa-610171c2bd70
status: experimental
description: |
    Returns information about events that meet the specified filter criteria.

    Security implications: Service health events can help attackers time actions when defenses or staff attention are reduced.

    Observed in real-world incidents/reporting, e.g.: Crimson Collective: A New Threat Group Observed Operating in the Cloud.
references:
    - https://www.rapid7.com/blog/post/tr-crimson-collective-a-new-threat-group-observed-operating-in-the-cloud/
    - https://aws.permissions.cloud/iam/health#health-DescribeEvents
    - https://traildiscover.cloud/#Health-DescribeEvents
author: Adan Alvarez (@adanalvarez), Yamato Security
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1526 #Cloud Service Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: health.amazonaws.com
        eventName: DescribeEvents
    condition: selection
falsepositives:
level: low
