title: AWS EC2 GetEbsEncryptionByDefault
id: 02ab7d11-15d3-58b0-914a-9303b5f1f280
status: experimental
description: |
    Describes whether EBS encryption by default is enabled for your account in the current Region.
    Security implications: Attackers might use GetEbsEncryptionByDefault to determine if new Amazon EBS volumes are encrypted by default, seeking to exploit unencrypted volumes.
    Observed in real-world incidents/reporting, e.g.: Compromised Cloud Compute Credentials: Case Studies From the Wild.
references:
    - https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/#post-125981-_kdq0vw6banab
    - https://aws.permissions.cloud/iam/ec2#ec2-GetEbsEncryptionByDefault
    - https://traildiscover.cloud/#EC2-GetEbsEncryptionByDefault
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1580 #Cloud Infrastructure Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: GetEbsEncryptionByDefault
    condition: selection
falsepositives:
level: low
