title: AWS IAM GetLoginProfile
id: a5525341-a0a4-52b4-8d80-3e8bf4bf13fc
status: experimental
description: |
    Retrieves the user name for the specified IAM user.
    Security implications: Attackers might use GetLoginProfile to know if the account has a login profile or to get its user name.
    Observed in real-world incidents/reporting, e.g.: UNMASKING GUI-VIL: FINANCIALLY MOTIVATED CLOUD THREAT ACTOR.
references:
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor/
    - https://aws.permissions.cloud/iam/iam#iam-GetLoginProfile
    - https://traildiscover.cloud/#IAM-GetLoginProfile
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1087 #Account Discovery
    - attack.t1087.004 #Account Discovery: Cloud Account
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName: GetLoginProfile
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Routine enumeration by administrators, monitoring/inventory tools, or the AWS Console and SDKs.
    - Security, backup, or cost-management tooling that periodically reads this resource.
level: informational
