title: AWS GuardDuty UpdateIPSet
id: 39dc497a-c775-590f-b8b3-fe2da90a6364
status: experimental
description: |
    Updates the IPSet specified by the IPSet ID.
    Security implications: Attackers might use UpdateIPSet to modify the IP address filters, potentially allowing malicious traffic to bypass detection.
references:
    - https://hackingthe.cloud/aws/avoiding-detection/modify-guardduty-config/
    - https://aws.permissions.cloud/iam/guardduty#guardduty-UpdateIPSet
    - https://traildiscover.cloud/#GuardDuty-UpdateIPSet
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.defense-evasion
    - attack.t1562 #Impair Defenses
    - attack.t1562.001 #Impair Defenses: Disable or Modify Tools
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: guardduty.amazonaws.com
        eventName: UpdateIPSet
    condition: selection
falsepositives:
level: medium
