title: AWS ECR GetAuthorizationToken Attempt
id: 093188a6-7138-5fcb-9895-ce9c43b7fcf9
status: experimental
description: |
    Retrieves an authorization token that can be used to authenticate to an Amazon ECR registry.
    Security implications: Attackers might use GetAuthorizationToken to authenticate a Docker client to Amazon ECR, enabling them to pull private container images containing proprietary code and secrets.
    Observed in real-world incidents/reporting, e.g.: Investigating Suspected DPRK-Linked Crypto Intrusions.
references:
    - https://ctrlaltintel.com/threat%20research/DPRK-Crypto-Heist/
    - https://aws.permissions.cloud/iam/ecr#ecr-GetAuthorizationToken
    - https://traildiscover.cloud/#ECR-GetAuthorizationToken
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.credential-access
    - attack.t1528 #Steal Application Access Token
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ecr.amazonaws.com
        eventName: GetAuthorizationToken
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and (error_code or error_msg)
falsepositives:
    - Routine enumeration by administrators, monitoring/inventory tools, or the AWS Console and SDKs.
    - Security, backup, or cost-management tooling that periodically reads this resource.
level: medium
