title: AWS GuardDuty StopMonitoringMembers
id: e6a6265a-1a3e-5159-ad0e-2ff17fd5c1b4
status: experimental
description: |
    Stops GuardDuty monitoring for the specified member accounts.
    Security implications: Attackers might use StopMonitoringMembers to halt the surveillance of specific AWS accounts, reducing security visibility.
references:
    - https://www.chrisfarris.com/post/reinforce-threat-hunting/
    - https://aws.permissions.cloud/iam/guardduty#guardduty-StopMonitoringMembers
    - https://traildiscover.cloud/#GuardDuty-StopMonitoringMembers
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.defense-evasion
    - attack.t1562 #Impair Defenses
    - attack.t1562.001 #Impair Defenses: Disable or Modify Tools
    - attack.t1562.008 #Impair Defenses: Disable or Modify Cloud Logs
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: guardduty.amazonaws.com
        eventName: StopMonitoringMembers
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Planned decommissioning, cleanup, or teardown by administrators or CI/CD.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK) destroying or replacing resources.
level: high
