title: AWS IAM DeleteUserPermissionsBoundary
id: 9dd6e707-46cf-5209-9a5c-97b93c016fa8
status: experimental
description: |
    Deletes the permissions boundary for the specified IAM user.
    Security implications: Attackers might use DeleteUserPermissionsBoundary to remove restrictions and gain unauthorized access to AWS resources.
    Ex: aws iam delete-user-permissions-boundary --user-name TrailDiscover
references:
    - https://hackingthe.cloud/aws/exploitation/iam_privilege_escalation/
    - https://aws.permissions.cloud/iam/iam#iam-DeleteUserPermissionsBoundary
    - https://traildiscover.cloud/#IAM-DeleteUserPermissionsBoundary
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.privilege-escalation
    - attack.t1098 #Account Manipulation
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: iam.amazonaws.com
        eventName: DeleteUserPermissionsBoundary
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Planned decommissioning, cleanup, or teardown by administrators or CI/CD.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK) destroying or replacing resources.
level: medium
