title: AWS events DisableRule
id: a805c6c1-449a-529f-9663-db904a363110
status: experimental
description: |
    Disables the specified rule.
    Security implications: Attackers might use DisableRule to deactivate AWS EventBridge rules, effectively silencing alarms and automated responses designed for incident detection and mitigation.
references:
    - https://www.elastic.co/guide/en/security/7.17/rules-api-delete.html
    - https://docs.datadoghq.com/security/default_rules/aws-eventbridge-rule-disabled-or-deleted/
    - https://aws.permissions.cloud/iam/events#events-DisableRule
    - https://traildiscover.cloud/#events-DisableRule
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.impact
    - attack.defense-evasion
    - attack.t1489 #Service Stop
    - attack.t1578 #Modify Cloud Compute Infrastructure
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: events.amazonaws.com
        eventName: DisableRule
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Planned decommissioning, cleanup, or teardown by administrators or CI/CD.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK) destroying or replacing resources.
level: high
