title: AWS GuardDuty GetDetector
id: c188eebb-be13-56d6-9bed-d0c2097beaa1
status: experimental
description: |
    Retrieves an Amazon GuardDuty detector specified by the detectorId.
    Security implications: Attackers might use GetDetector to identify active threat detection systems in AWS GuardDuty.
    Ex: aws guardduty get-detector --detector-id TrailDiscoverDetectorId
    Observed in real-world incidents/reporting, e.g.: The curious case of DangerDev@protonmail.me.
references:
    - https://www.invictus-ir.com/news/the-curious-case-of-dangerdev-protonmail-me
    - https://aws.permissions.cloud/iam/guardduty#guardduty-GetDetector
    - https://traildiscover.cloud/#GuardDuty-GetDetector
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.t1526 #Cloud Service Discovery
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: guardduty.amazonaws.com
        eventName: GetDetector
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and not (error_code or error_msg)
falsepositives:
    - Routine enumeration by administrators, monitoring/inventory tools, or the AWS Console and SDKs.
    - Security, backup, or cost-management tooling that periodically reads this resource.
level: informational
