title: Get Credentials For Identity
id: 41b73340-8b0d-438f-9d35-ae0b4a21f136
status: experimental
description: |
    Returns credentials for the provided identity ID. Any provided logins will be validated against supported login providers.
references:
    - https://hackingthe.cloud/aws/exploitation/cognito_identity_pool_excessive_privileges/#exploitation
    - https://traildiscover.cloud/#CognitoIdentity-GetCredentialsForIdentity
author: Zach Mathis (@yamatosecurity)
date: 2025-04-23
modified: 2025-04-23
tags:
    - attack.credential-access
    - attack.t1078.004 # Valid Accounts: Cloud Accounts
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'GetCredentialsForIdentity'
    filter:
        errorCode: 'AccessDenied'
    condition: selection and not filter
falsepositives:
level: high