title: AWS Bedrock InvokeModel Attempt
id: 22489fc3-d99e-55c2-8b61-e5328358d9e8
status: experimental
description: |
    Invokes the specified Amazon Bedrock model to run inference using the prompt and inference parameters provided in the request body.
    Security implications: Attackers might use InvokeModel to check if the credentials have access to the LLMs and they have been enabled and invoke the model for resource hijacking.
    Observed in real-world incidents/reporting, e.g.: LLMjacking: Stolen Cloud Credentials Used in New AI Attack; Detecting AI resource-hijacking with Composite Alerts; New tactics and techniques for proactive threat detection; When AI Gets Hijacked: Exploiting Hosted Models for Dark Roleplaying; New Developments in LLM Hijacking Activity; Datadog threat roundup: top insights for Q4 2024.
references:
    - https://sysdig.com/blog/llmjacking-stolen-cloud-credentials-used-in-new-ai-attack/
    - https://www.lacework.com/blog/detecting-ai-resource-hijacking-with-composite-alerts
    - https://reinforce.awsevents.com/content/dam/reinforce/2024/slides/TDR432_New-tactics-and-techniques-for-proactive-threat-detection.pdf
    - https://permiso.io/blog/exploiting-hosted-models
    - https://www.wiz.io/blog/jinx-2401-llm-hijacking-aws
    - https://securitylabs.datadoghq.com/articles/2024-q4-threat-roundup/
    - https://aws.permissions.cloud/iam/bedrock#bedrock-InvokeModel
    - https://traildiscover.cloud/#Bedrock-InvokeModel
author: Zach Mathis (@YamatoSecurity)
date: 2026-07-12
modified: 2026-07-12
tags:
    - attack.discovery
    - attack.impact
    - attack.t1580 #Cloud Infrastructure Discovery
    - attack.t1496 #Resource Hijacking
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: bedrock.amazonaws.com
        eventName: InvokeModel
    error_code:
        errorCode|exists: true
    error_msg:
        errorMessage|exists: true
    condition: selection and (error_code or error_msg)
falsepositives:
    - Legitimate provisioning or configuration changes by administrators or CI/CD pipelines.
    - Infrastructure-as-code (Terraform, CloudFormation, CDK, Pulumi) applying changes.
level: low
