title: EC2 Password Data Retrieved
id: dca4edde-477d-46d9-a2ec-5eb2117bbaa0
status: test
description: Detects retrieval or attempted retrieval of EC2 password data, which may indicate an attacker gaining access to an instance's password.
references:
author: Zach Mathis (@yamatosecurity)
date: 2025-08-02
modified: 2025-08-02
tags:
    - attack.credential_access
    - attack.t1555 # Credentials from Password Stores
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: ec2.amazonaws.com
        eventName: 'GetPasswordData'
    condition: selection
level: low