title: User Enumeration 
id: 6125226d-0eb4-4dc8-8cb6-ac5ad01973ab
status: test
description: 
references:
author: Zach Mathis (@yamatosecurity)
date: 2025-04-24
modified: 2025-04-24
tags:
    - attack.exfiltration
    - attack.persistence
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'ListUsers'
    condition: selection
falsepositives:
level: low