title: Attempt To Get Credentials For Identity
id: 535c3745-3883-4cc8-a635-1a56cc3d6384
status: experimental
description: |
    Returns credentials for the provided identity ID. Any provided logins will be validated against supported login providers.
references:
    - https://hackingthe.cloud/aws/exploitation/cognito_identity_pool_excessive_privileges/#exploitation
    - https://traildiscover.cloud/#CognitoIdentity-GetCredentialsForIdentity
author: Zach Mathis (@yamatosecurity)
date: 2025-04-23
modified: 2025-04-23
tags:
    - attack.credential-access
    - attack.t1078.004 # Valid Accounts: Cloud Accounts
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'GetCredentialsForIdentity'
        errorCode: 'AccessDenied'
    condition: selection
falsepositives:
level: medium