title: Attempt To Get Signin Token
id: b1a88df9-bf9f-48f4-a1c8-1d443923b951
status: experimental
description: |
    Generate a SigninToken that can be used to login to the the AWS Management Console.
    Attackers might access via a Federated identity (such as AWS SSO) to the Management Console.
references:
    - https://fwdcloudsec.org/assets/presentations/2024/europe/sebastian-walla-cloud-conscious-tactics-techniques-and-procedures-an-overview.pdf
    - https://securitylabs.datadoghq.com/articles/tales-from-the-cloud-trenches-unwanted-visitor/
    - https://traildiscover.cloud/#SignIn-GetSigninToken
author: Zach Mathis (@yamatosecurity)
date: 2025-04-23
modified: 2025-04-23
tags:
    - attack.credential-access
    - attack.t1078.004 # Valid Accounts: Cloud Accounts
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'GetSigninToken'
        errorCode: 'AccessDenied'
    condition: selection
falsepositives:
level: medium